HSDTaskName = "Roskafaksien esto";

//progress title when printing the junk fax list
"PRINT_PROGRESS_TITLE" = "Tulostetaan… Odota";

//button titles
"DONE" = "Valmis";
"YES" = "Kyllä";
"NO" = "Ei";
"OK" = "OK";
"CLOSE" = "Sulje";
DeleteButtonTitle = "Poista";

//Block status label
"BLOCK_STATUS_MESSAGE" = "%1$d / %2$d valintaa käytetty";

//Not a valid block fax number
"INVALID_FAX_NUMBER_TITLE" = "Virheellinen faksinumero";
"INVALID_FAX_NUMBER_DESC" = "Annoit virheellisen numeron. Voit käyttää vain numeroita (0123456789). Anna kelvollinen faksinumero ja yritä uudelleen.";

//Caller ID required warning message, when Block status is made ON
"JUNK_FAX_WARNING_TITLE" = "Vaatii soittajanumeron";
"JUNK_FAX_WARNING_DESC" = "Roskafaksien esto vaatii, että laite on yhdistetty linjaan, jossa on käytössä soittajanumeropalvelu.\n\nJos et ole varma, onko linjassa soittajanumeropalvelu käytössä, ota yhteys puhelinyhtiöösi.";
"JUNK_FAX_DELETION_DESC" = "Oletko varma, että haluat poistaa valitut numerot estettyjen faksinumeroiden luettelosta?";

//Duplicate entry error, If we need to allow duplicates
"DUPLICATE_JUNK_FAX_ENTRY_TITLE" = "Sama roskafaksin numero";
"DUPLICATE_JUNK_FAX_ENTRY_DESC" = "Tämä numero on jo roskafaksiluettelossa. Haluatko lisätä sen uudelleen?";

//Duplicate entry Error.
"DUPLICATE_JUNK_FAX_ENTRY_TITLE1" = "Sama roskafaksin numero";
"DUPLICATE_JUNK_FAX_ENTRY_DESC1" = "Tämä numero on jo roskafaksiluettelossa.";

// explanation why the fax setting were not applied
FaxNotAppliedExplanation = "Varmista, että laite on online-tilassa eikä käsittele faksaustyötä.";

HSDTaskDescriptionTitle = "Käytä Roskafaksien esto -toimintoa estääksesi tietyistä soittajanumeroista saapuvat faksit.";
HSDJunkFaxBlockingStateTitle = "Faksin esto soittajanumerolla:";
HSDBlockedNumbersTitle = "Estetyt numerot:";
HSDApplyButtonTitle = "Ota käyttöön";
HSDPrintListButtonTitle = "Tulosta luettelo";

HSDEditPanelDescriptionTitle = "Anna estettävä faksinumero:";
HSDOffButtonTitle = "Pois";
HSDOnButtonTitle = "Päällä";

HSDFaxNumberTitle = "Faksinumero";
HSDEditButtonTitle = "Muokkaa...";
HSDCreateButtonTitle = "Luo";
HSDCancelButtonTitle = "Peruuta";

AskSaveChangesAlertTitle = "Faksien estoluetteloa on muokattu";
AskSaveChangesAlertMsg = "Tekemäsi muutokset eivät näy tulostetussa luettelossa, ellei niitä oteta käyttöön. Haluatko ottaa luetteloon tehdyt muutokset käyttöön ennen luettelon tulostamista?";
AskSaveChangesDontApplyButtonTitle = "Älä käytä";
AskSaveCahngesApplyButtonTitle = "Käytä";

PlusButtonToolTip = "Lisää uusi estetty numero";
MinusButtonToolTip = "Poista estetty numero";
EditButtonToolTip = "Muokkaa estettyä numeroa";
PrintButtonToolTip = "Tulosta estetyt numerot";
